Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 1, 4096, 1)   0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 4096, 32)  128         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1, 4096, 32)  128         conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 4096, 32)  0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 4096, 32)  3104        activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 1, 4096, 32)  128         conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1, 4096, 32)  0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 2048, 32)  0           activation_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 1, 2048, 64)  6208        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1, 2048, 64)  256         conv2d_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 1, 2048, 64)  0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 1, 2048, 64)  12352       activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1, 2048, 64)  256         conv2d_4[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 1, 2048, 64)  0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 1024, 64)  0           activation_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1024, 128) 24704       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1, 1024, 128) 512         conv2d_5[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 1, 1024, 128) 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 1024, 128) 49280       activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 1, 1024, 128) 512         conv2d_6[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 1, 1024, 128) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 512, 128)  0           activation_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 512, 256)  98560       max_pooling2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 1, 512, 256)  1024        conv2d_7[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 1, 512, 256)  0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 512, 256)  196864      activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1, 512, 256)  1024        conv2d_8[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 1, 512, 256)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 1, 256, 256)  0           activation_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 256, 512)  393728      max_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1, 256, 512)  2048        conv2d_9[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 1, 256, 512)  0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 256, 512)  786944      activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1, 256, 512)  2048        conv2d_10[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 1, 256, 512)  0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 1, 128, 512)  0           activation_10[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 128, 1024) 1573888     max_pooling2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 1, 128, 1024) 4096        conv2d_11[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 1, 128, 1024) 0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 128, 1024) 3146752     activation_11[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1, 128, 1024) 4096        conv2d_12[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 1, 128, 1024) 0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 1, 256, 1024) 0           activation_12[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 256, 1536) 0           up_sampling2d_1[0][0]
                                                                 activation_10[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 256, 512)  2359808     concatenate_1[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1, 256, 512)  2048        conv2d_13[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 256, 512)  0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 256, 512)  786944      activation_13[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 256, 512)  2048        conv2d_14[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1, 256, 512)  0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 1, 512, 512)  0           activation_14[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 512, 768)  0           up_sampling2d_2[0][0]
                                                                 activation_8[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 512, 256)  590080      concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 1, 512, 256)  1024        conv2d_15[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 512, 256)  0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 512, 256)  196864      activation_15[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 1, 512, 256)  1024        conv2d_16[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 1, 512, 256)  0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 1, 1024, 256) 0           activation_16[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1, 1024, 384) 0           up_sampling2d_3[0][0]
                                                                 activation_6[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 1, 1024, 128) 147584      concatenate_3[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 1, 1024, 128) 512         conv2d_17[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 1, 1024, 128) 0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 1, 1024, 128) 49280       activation_17[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 1, 1024, 128) 512         conv2d_18[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 1, 1024, 128) 0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 1, 2048, 128) 0           activation_18[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 1, 2048, 192) 0           up_sampling2d_4[0][0]
                                                                 activation_4[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 2048, 64)  36928       concatenate_4[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 1, 2048, 64)  256         conv2d_19[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 1, 2048, 64)  0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 2048, 64)  12352       activation_19[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 1, 2048, 64)  256         conv2d_20[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 1, 2048, 64)  0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 1, 4096, 64)  0           activation_20[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 1, 4096, 96)  0           up_sampling2d_5[0][0]
                                                                 activation_2[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 4096, 32)  9248        concatenate_5[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 1, 4096, 32)  128         conv2d_21[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 1, 4096, 32)  0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 1, 4096, 32)  3104        activation_21[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 4096, 32)  128         conv2d_22[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 1, 4096, 32)  0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
spatial_dropout2d_1 (SpatialDro (None, 1, 4096, 32)  0           activation_22[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 1, 4096, 2)   66          spatial_dropout2d_1[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 1, 4096, 2)   0           conv2d_23[0][0]
==================================================================================================
Total params: 10,508,834
Trainable params: 10,496,802
Non-trainable params: 12,032
__________________________________________________________________________________________________
None